# Error message ID that has a null message, but takes in a single object.
functionNotSupported = Aquesta funci\u00F3 no t\u00E9 suport.

cannotOverwriteCause = No es pot sobreescriure una causa

noDefaultImpl = No s'ha trobat cap implementaci\u00F3 per defecte 

chunkedintarrayNotSupported = Actualment no es d\u00F3na suport a ChunkedIntArray({0})

offsetBiggerThanSlot = El despla\u00E7ament \u00E9s m\u00E9s gran que la ranura

coroutineNotAvail = Coroutine no est\u00E0 disponible, id\={0}

coroutineCoExit = CoroutineManager ha rebut una sol\u00B7licitud co_exit()

cojoinroutinesetFailed = S'ha produ\u00EFt un error a co_joinCoroutineSet()

typedIteratorAxisNotImplemented = Error\: l''iterador de tipus de l''eix {0} no s''ha implementat

iteratorCloneNotSupported = El clonatge de l'iterador no t\u00E9 suport

unknownAxisType = Tipus de commutaci\u00F3 de l''eix desconeguda\: {0}

noDtmidsAvail = No hi ha m\u00E9s ID de DTM disponibles

notSupported = No t\u00E9 suport\: {0}

nodeNonNull = El node no ha de ser nul per a getDTMHandleFromNode

couldNotResolveNode = No s'ha pogut resoldre el node en un manejador

startparseWhileParsing = startParse no es pot cridar mentre s'est\u00E0 duent a terme l'an\u00E0lisi

startparseNeedsSaxparser = startParse necessita un SAXParser que no sigui nul

couldNotInitParser = No s'ha pogut inicialitzar l'analitzador amb

exceptionCreatingPool = S'ha produ\u00EFt una excepci\u00F3 en crear una nova inst\u00E0ncia de l'agrupaci\u00F3

pathContainsInvalidEscapeSequence = La via d'acc\u00E9s cont\u00E9 una seq\u00FC\u00E8ncia d'escapament no v\u00E0lida

schemeRequired = Es necessita l'esquema

noSchemeInUri = No s''ha trobat cap esquema a l''URI\: {0}

noSchemeInuri = No s'ha trobat cap esquema a l'URI

pathInvalidChar = La via d''acc\u00E9s cont\u00E9 un car\u00E0cter no v\u00E0lid {0}

schemeFromNullString = No es pot establir un esquema des d'una cadena nul\u00B7la

schemeNotConformant = L'esquema no t\u00E9 conformitat.

hostAddressNotWellformed = El format de l'adre\u00E7a del sistema principal no \u00E9s el correcte

portWhenHostNull = El port no es pot establir quan el sistema principal \u00E9s nul

invalidPort = N\u00FAmero de port no v\u00E0lid

fragForGenericUri = El fragment nom\u00E9s es pot establir per a un URI gen\u00E8ric

fragWhenPathNull = El fragment no es pot establir si la via d'acc\u00E9s \u00E9s nul\u00B7la

fragInvalidChar = El fragment cont\u00E9 un car\u00E0cter no v\u00E0lid

selfCausationNotPermitted = La causalitat pr\u00F2pia no est\u00E0 permesa.

noUserinfoIfNoHost = No es pot especificar informaci\u00F3 de l'usuari si no s'especifica el sistema principal

noPortIfNoHost = No es pot especificar el port si no s'especifica el sistema principal

noQueryStringInPath = No es pot especificar una cadena de consulta en la via d'acc\u00E9s i la cadena de consulta

noFragmentStringInPath = No es pot especificar un fragment tant en la via d'acc\u00E9s com en el fragment

cannotInitUriEmptyParms = No es pot inicialitzar l'URI amb par\u00E0metres buits

methodNotSupported = Aquest m\u00E8tode encara no t\u00E9 suport 

incrsaxsrcfilterNotRestartable = Ara mateix no es pot reiniciar IncrementalSAXSource_Filter

xmlrdrNotBeforeStartparse = XMLReader no es pot produir abans de la sol\u00B7licitud d'startParse

errorhandlerCreatedWithNullPrintwriter = S'ha creat ListingErrorHandler amb PrintWriter nul

systemidUnknown = ID del sistema (SystemId) desconegut

locationUnknown = Ubicaci\u00F3 de l'error desconeguda

prefixMustResolve = El prefix s''ha de resoldre en un espai de noms\: {0}

childHasNoOwnerDocumentElement = El subordinat de l'atribut no t\u00E9 un element de document de propietari.

cantOutputTextBeforeDoc = Av\u00EDs\: no es pot produir text abans de l'element de document. Es passa per alt.

cantHaveMoreThanOneRoot = No hi pot haver m\u00E9s d'una arrel en un DOM.

argLocalnameNull = L'argument 'localName' \u00E9s nul.

# Note to translators: A QNAME has the syntactic form [NCName:]NCName
# The localname is the portion after the optional colon; the message indicates
# that there is a problem with that part of the QNAME.
argLocalnameInvalid = El nom local de QNAME ha de ser un NCName v\u00E0lid.

# Note to translators: A QNAME has the syntactic form [NCName:]NCName.
# The prefix is the portion before the optional colon; the message indicates
# that there is a problem with that part of the QNAME.
argPrefixInvalid = El prefix de QNAME ha de ser un NCName v\u00E0lid.

nameCantStartWithColon = El nom no pot comen\u00E7ar amb dos punts. 

line = L\u00EDnia n\u00FAm.

column = Columna n\u00FAm.
