# Error message ID that has a null message, but takes in a single object.
functionNotSupported = \u00A1Funci\u00F3n no soportada\!

cannotOverwriteCause = No se puede escribir encima de la causa

noDefaultImpl = No se ha encontrado una implementaci\u00F3n predeterminada 

chunkedintarrayNotSupported = ChunkedIntArray({0}) no soportada actualmente

offsetBiggerThanSlot = El desplazamiento es mayor que el espacio

coroutineNotAvail = Corrutina no disponible, id\={0}

coroutineCoExit = CoroutineManager ha recibido una petici\u00F3n co_exit()

cojoinroutinesetFailed = Anomal\u00EDa de co_joinCoroutineSet()

typedIteratorAxisNotImplemented = Error\: El iterador escrito para el eje {0} no est\u00E1 implementado

iteratorCloneNotSupported = La r\u00E9plica del iterador no est\u00E1 soportada

unknownAxisType = Tipo de cruce de eje desconocido\: {0}

noDtmidsAvail = No hay m\u00E1s ID de DTM disponibles

notSupported = No soportado\: {0}

nodeNonNull = El nodo no debe ser nulo para getDTMHandleFromNode

couldNotResolveNode = No se puede resolver el nodo como un manejador

startparseWhileParsing = No se puede llamar a startParse mientras se est\u00E1 analizando

startparseNeedsSaxparser = startParse necesita un SAXParser no nulo

couldNotInitParser = No se ha podido inicializar el analizador con

exceptionCreatingPool = Se ha producido una excepci\u00F3n al crear la nueva instancia de la agrupaci\u00F3n

pathContainsInvalidEscapeSequence = La v\u00EDa de acceso contiene una secuencia de escape no v\u00E1lida

schemeRequired = \u00A1Se necesita un esquema\!

noSchemeInUri = No se ha encontrado un esquema en el URI\: {0}

noSchemeInuri = No se ha encontrado un esquema en el URI

pathInvalidChar = La v\u00EDa de acceso contiene un car\u00E1cter no v\u00E1lido\: {0}

schemeFromNullString = No se puede establecer un esquema de una serie nula

schemeNotConformant = El esquema no es compatible.

hostAddressNotWellformed = El sistema principal no es una direcci\u00F3n bien formada

portWhenHostNull = No se puede establecer el puerto si el sistema principal es nulo

invalidPort = N\u00FAmero de puerto no v\u00E1lido

fragForGenericUri = S\u00F3lo se puede establecer el fragmento para un URI gen\u00E9rico

fragWhenPathNull = No se puede establecer el fragmento si la v\u00EDa de acceso es nula

fragInvalidChar = El fragmento contiene un car\u00E1cter no v\u00E1lido

selfCausationNotPermitted = Autocausalidad no permitida

noUserinfoIfNoHost = No se puede especificar la informaci\u00F3n de usuario si no se ha especificado el sistema principal

noPortIfNoHost = No se puede especificar el puerto si no se ha especificado el sistema principal

noQueryStringInPath = No se puede especificar la serie de consulta en la v\u00EDa de acceso y en la serie de consulta

noFragmentStringInPath = No se puede especificar el fragmento en la v\u00EDa de acceso y en el fragmento

cannotInitUriEmptyParms = No se puede inicializar el URI con par\u00E1metros vac\u00EDos

methodNotSupported = El m\u00E9todo no est\u00E1 a\u00FAn soportado 

incrsaxsrcfilterNotRestartable = IncrementalSAXSource_Filter no es actualmente reiniciable

xmlrdrNotBeforeStartparse = XMLReader no debe ir antes que la petici\u00F3n startParse

errorhandlerCreatedWithNullPrintwriter = \u00A1Se ha creado ListingErrorHandler con PrintWriter nulo\!

systemidUnknown = SystemId desconocido

locationUnknown = Ubicaci\u00F3n del error desconocida

prefixMustResolve = El prefijo debe resolverse como un espacio de nombres\: {0}

childHasNoOwnerDocumentElement = \u00A1El hijo atributo no tiene un elemento documento propietario\!

cantOutputTextBeforeDoc = \u00A1Aviso\: no puede haber salida de texto antes del elemento documento\!  Ignorando...

cantHaveMoreThanOneRoot = \u00A1No puede haber m\u00E1s de una ra\u00EDz en DOM\!

argLocalnameNull = El argumento 'localName' es nulo

# Note to translators: A QNAME has the syntactic form [NCName:]NCName
# The localname is the portion after the optional colon; the message indicates
# that there is a problem with that part of the QNAME.
argLocalnameInvalid = Localname en QNAME debe ser un NCName v\u00E1lido

# Note to translators: A QNAME has the syntactic form [NCName:]NCName.
# The prefix is the portion before the optional colon; the message indicates
# that there is a problem with that part of the QNAME.
argPrefixInvalid = El prefijo en QNAME debe ser un NCName v\u00E1lido

nameCantStartWithColon = El nombre no puede empezar con dos puntos

line = L\u00EDnea n\u00FAm.

column = Columna n\u00FAm.
